export const array = [
  {
    num: "",
    title:
      " Сделайте файл с вашей первой программой. Выведите в ней на экран какой-нибудь текст.",
  },
  {
    num: " ",
    title:
      " Создайте файл со скриптом. Подключите его к вашему HTML файлу. Проверьте его работу.",
  },
  {
    num: " ",
    title:
      "Создайте три файла со скриптами. Подключите их к вашему HTML файлу. Проверьте их работу.",
  },
  {
    num: " ",
    title:
      " Исправьте подключение вашего файла так, чтобы после имени файла следовал номер его версии",
  },
  {
    num: " ",
    title:
      " Создайте переменную num и присвойте ей значение 123. Выведите значение этой переменной на экран с помощью функции alert.",
  },
  {
    num: " ",
    title:
      "Создайте переменную a. Запишите в нее значение 10, выведите его на экран. Затем запишите в нее значение 20, выведите его на экран.",
  },
  {
    num: " ",
    title:
      "Создайте переменную a. Запишите в нее сумму чисел 1, 2 и 3. С помощью функции alert выведите на экран содержимое переменной a.",
  },
  {
    num: " ",
    title:
      " Создайте переменную a со значением 10 и переменную b со значением 2. Выведите на экран их сумму, разность, произведение и частное",
  },
  {
    num: " ",
    title:
      " Создайте переменную c со значением 10 и переменную d со значением 5. Просуммируйте их, а результат присвойте переменной result. Выведите на экран значение переменной result.",
  },
  {
    num: " ",
    title:
      " Создайте переменную a со значением 10 и переменную b со значением 5. Отнимите от a переменную b и результат присвойте переменной c. Затем создайте переменную d, присвойте ей значение 7. Сложите переменные c и d, а результат запишите в переменную result. Выведите на экран значение переменной result.",
  },
  {
    num: " ",
    title:
      " Создайте переменную a со значением -100. Выведите это значение на экран.",
  },
  {
    num: " ",
    title:
      " Создайте файл со скриптом. Подключите его к вашему HTML файлу. Проверьте его работу.",
  },
  {
    num: " ",
    title:
      " Создайте переменную a, запишите в нее какое-нибудь положительное или отрицательное число. Выведите на экран это число с обратным знаком.",
  },
  {
    num: " ",
    title: " Возведите число 2 в 10-ю степень. Выведите результат на экран.",
  },
  {
    num: " ",
    title:
      " Создайте строку с вашем именем и строку с вашей фамилией. Выведите эти данные на экран.",
  },
  {
    num: " ",
    title:
      " Создайте переменную str и присвойте ей строку '!!!'. Выведите значение этой переменной на экран.",
  },
  {
    num: " ",
    title:
      " Создайте переменную с текстом 'java' и переменную с текстом 'script'. С помощью этих переменных и операции сложения строк выведите на экран строку 'javascript'.",
  },
  {
    num: " ",
    title:
      "Создайте переменную с текстом 'hello' и переменную с текстом 'world'. С помощью этих переменных и операции сложения строк выведите на экран строку 'hello world'",
  },
  {
    num: " ",
    title:
      " Запишите в переменную str строку, состоящую из символов 'a', 'b', 'c', причем после каждого символа, кроме последнего, должен стоять переносстроки.",
  },
];

export const erand = {
  0: () => alert("dfsdfsdfafadf"),
  1: () => alert("sadasdd"),
  2: () => alert("sd"),
};
